In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.5.3'

In [4]:
None, np.nan

(None, nan)

In [6]:
s = pd.Series([1, 3, 4, np.nan, 6, 8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
type(s)

pandas.core.series.Series

In [11]:
dates = pd.date_range('20130101', periods =6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [14]:
df = pd.DataFrame({'A' : [1, 2, 3],
                  'B' : [1, 2, 3],
                  'C' : [1, 2, 3]})
df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [15]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.279246  1.037761  0.453453 -1.618048
2013-01-02  1.502188 -2.681873  0.817943 -1.076079
2013-01-03  0.401963  0.501184  0.133135 -1.095632
2013-01-04  0.804234  0.053530  1.109272 -1.545593
2013-01-05  0.915758  0.385388 -2.101644 -0.692154
2013-01-06 -0.056490  0.621262 -0.186342 -0.550554

In [20]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

In [24]:
dane_sprzedaz_df = pd.read_csv('data/dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [28]:
dane_sprzedaz_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 135 entries, 0 to 134
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DZIEN_DATA    135 non-null    object
 1   SKL_ID        135 non-null    int64
 2   TOW_ID        135 non-null    int64
 3   SPRZ_NETTO    133 non-null    float64
 4   ZYSK_PROCENT  135 non-null    int64
 5   ZYSK_WART     135 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 6.5+ KB

In [25]:
dane_sprzedaz_df.describe()

           SKL_ID      TOW_ID  SPRZ_NETTO  ZYSK_PROCENT
count  135.000000  135.000000  133.000000    135.000000
mean     2.000000    2.000000  397.473684      7.659259
std      0.819538    0.819538   54.623724      4.044829
min      1.000000    1.000000  300.000000      1.000000
25%      1.000000    1.000000  356.000000      4.000000
50%      2.000000    2.000000  390.000000      7.000000
75%      3.000000    3.000000  443.000000     11.000000
max      3.000000    3.000000  498.000000     15.000000

In [29]:
df = pd.DataFrame(np.random.randn(6,4),
                 index=dates,
                 columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.704851 -0.525659  0.819931  0.639669
2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-04  0.846103 -1.621606  1.206899 -0.116004
2013-01-05  0.220643 -0.231653  1.865159 -0.314346
2013-01-06  1.229805  0.694843 -0.229361 -1.471800

In [32]:
df.head(4)

                   A         B         C         D
2013-01-01  1.704851 -0.525659  0.819931  0.639669
2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-04  0.846103 -1.621606  1.206899 -0.116004

In [36]:
df.tail()

                   A         B         C         D
2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-04  0.846103 -1.621606  1.206899 -0.116004
2013-01-05  0.220643 -0.231653  1.865159 -0.314346
2013-01-06  1.229805  0.694843 -0.229361 -1.471800

In [37]:
df.values

array([[ 1.70485067, -0.52565887,  0.81993106,  0.63966908],
       [-0.71783996,  0.09802216,  2.81207574, -1.09393061],
       [-1.02168467,  0.59336995, -0.50611546,  1.4663457 ],
       [ 0.84610257, -1.62160584,  1.20689898, -0.11600352],
       [ 0.22064329, -0.23165253,  1.86515911, -0.31434575],
       [ 1.22980491,  0.69484316, -0.22936085, -1.47180013]])

In [38]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [39]:
import numpy as np
import pandas as pd

my_array = np.array([[11,22,33],[44,55,66]])

df_numpy = pd.DataFrame(my_array, columns = ['Column_A','Column_B','Column_C'])

print(df_numpy)
print(type(df_numpy))

   Column_A  Column_B  Column_C
0        11        22        33
1        44        55        66
<class 'pandas.core.frame.DataFrame'>

In [40]:
data = {
        'col_1': [3, 2, 1, 0], 
        'col_2': ['a', 'b', 'c', 'd']
        }
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [41]:
df

                   A         B         C         D
2013-01-01  1.704851 -0.525659  0.819931  0.639669
2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-04  0.846103 -1.621606  1.206899 -0.116004
2013-01-05  0.220643 -0.231653  1.865159 -0.314346
2013-01-06  1.229805  0.694843 -0.229361 -1.471800

In [42]:
df.shape

(6, 4)

In [43]:
df.size

24

In [44]:
len(df)

6

In [46]:
df.sample(2)

                   A         B         C         D
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-05  0.220643 -0.231653  1.865159 -0.314346

In [48]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [49]:
type(df)

pandas.core.frame.DataFrame

In [51]:
type(df.A) #chcecking out the type of specific column!

pandas.core.series.Series

In [52]:
df.A #Chcecking out

2013-01-01    1.704851
2013-01-02   -0.717840
2013-01-03   -1.021685
2013-01-04    0.846103
2013-01-05    0.220643
2013-01-06    1.229805
Freq: D, Name: A, dtype: float64

In [53]:
df.T #Transposition - changing columns with rows

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.704851   -0.717840   -1.021685    0.846103    0.220643    1.229805
B   -0.525659    0.098022    0.593370   -1.621606   -0.231653    0.694843
C    0.819931    2.812076   -0.506115    1.206899    1.865159   -0.229361
D    0.639669   -1.093931    1.466346   -0.116004   -0.314346   -1.471800

In [55]:
df_sample = df.sample(2)

In [68]:
df.sort_values(by="B", ascending = True)

                   A         B         C         D
2013-01-04  0.846103 -1.621606  1.206899 -0.116004
2013-01-01  1.704851 -0.525659  0.819931  0.639669
2013-01-05  0.220643 -0.231653  1.865159 -0.314346
2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-06  1.229805  0.694843 -0.229361 -1.471800

In [69]:
df #data frame bez interwencji

                   A         B         C         D
2013-01-01  1.704851 -0.525659  0.819931  0.639669
2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2013-01-03 -1.021685  0.593370 -0.506115  1.466346
2013-01-04  0.846103 -1.621606  1.206899 -0.116004
2013-01-05  0.220643 -0.231653  1.865159 -0.314346
2013-01-06  1.229805  0.694843 -0.229361 -1.471800

In [65]:
df.reset_index(drop=True) #resetowanie indexu w Data Framie

          A         B         C         D
0  1.704851 -0.525659  0.819931  0.639669
1 -0.717840  0.098022  2.812076 -1.093931
2 -1.021685  0.593370 -0.506115  1.466346
3  0.846103 -1.621606  1.206899 -0.116004
4  0.220643 -0.231653  1.865159 -0.314346
5  1.229805  0.694843 -0.229361 -1.471800

In [66]:
df.reset_index(drop=False) #resetowanie indexu w Data Framie

       index         A         B         C         D
0 2013-01-01  1.704851 -0.525659  0.819931  0.639669
1 2013-01-02 -0.717840  0.098022  2.812076 -1.093931
2 2013-01-03 -1.021685  0.593370 -0.506115  1.466346
3 2013-01-04  0.846103 -1.621606  1.206899 -0.116004
4 2013-01-05  0.220643 -0.231653  1.865159 -0.314346
5 2013-01-06  1.229805  0.694843 -0.229361 -1.471800

In [70]:
df.sum()

A    2.261877
B   -0.992682
C    5.968589
D   -0.890065
dtype: float64

In [74]:
df.min()

A   -1.021685
B   -1.621606
C   -0.506115
D   -1.471800
dtype: float64